const questionsBank = [

  // =========================
  // حرف الألف (7 أسئلة)
  // =========================

  {
    q: "ما الحيوان الذي يُلقّب بملك الغابة؟",
    letter: "أ",
    choices: ["أسد", "أرنب", "أفعى", "أيل"],
    answer: "أسد"
  },

  
  {
    q: "ما اسم الدولة التي عاصمتها أبوظبي؟",
    letter: "أ",
    choices: ["الإمارات", "الأردن", "أستراليا", "ألبانيا"],
    answer: "الإمارات"
  },

  
  {
    q: "ما اسم البحر الذي يفصل بين آسيا وأفريقيا؟",
    letter: "أ",
    choices: ["الأحمر", "الأبيض", "الأدرياتيكي", "الأصفر"],
    answer: "الأحمر"
  },
  {
    q: "ما اسم الكوكب الأبعد عن الشمس؟",
    letter: "أ",
    choices: ["أوجيوش", "أورانوس", "أرض", "أوبيوس"],
    answer: "أورانوس"
  },

  

  // =========================
  // حرف الباء (7 أسئلة)
  // =========================

  {
    q: "ما هي عاصمة لبنان؟",
    letter: "ب",
    choices: ["بيروت", "بغداد", "بنغازي", "باماكو"],
    answer: "بيروت"
  },

  {
    q: "ما اسم العملية التي يتحول فيها الماء إلى بخار؟",
    letter: "ب",
    choices: ["تبخر", "تبلور", "تجمد", "تبريد"],
    answer: "تبخر"
  },
  {
    q: "ما اسم الحيوان الذي يعيش في القطب الجنوبي؟",
    letter: "ب",
    choices: ["دب قطبي", "بطريق", "بقرة", "بغل"],
    answer: "بطريق"
  },
  {
    q: "ما عاصمة الصين؟",
    letter: "ب",
    choices: ["بكين", "بنغلاديش", "بولندا", "بلجيكا"],
    answer: "بكين"
  },
  {
    q: "ما اسم الجهاز الذي يقيس ضغط الهواء؟",
    letter: "ب",
    choices: ["بارومتر", "بوصلة", "بطارية", "بروتون"],
    answer: "بارومتر"
  },
  {
    q: "ما اسم السورة التي تبدأ بحرف الباء وتطرد الشياطين؟",
    letter: "ب",
    choices: ["البقرة", "البلد", "البروج", "البينة"],
    answer: "البقرة"
  },

  // =========================
  // حرف التاء (7 أسئلة)
  // =========================

  {
    q: "ما اسم العملية التي يتحول فيها السائل إلى صلب؟",
    letter: "ت",
    choices: ["تجمد", "تبخر", "تكثف", "تسامي"],
    answer: "تجمد"
  },
  {
    q: "ما اسم الدولة التي تنقسم في قارتين؟",
    letter: "ت",
    choices: ["تونس", "تركيا", "تنزانيا", "تايلاند"],
    answer: "تركيا"
  },

  {
    q: "ما اسم الجهاز الذي يقيس الزمن؟",
    letter: "ت",
    choices: ["ساعة", "تيرمومتر", "تلسكوب", "تسارع"],
    answer: "ساعة"
  },
  {
    q: "ما اسم الحيوان الذي يضع البيض؟",
    letter: "ت",
    choices: ["تمساح", "تونة", "تيس", "تدرج"],
    answer: "تمساح"
  },
  {
    q: "ما اسم العملية التي يتحول فيها البخار إلى ماء؟",
    letter: "ت",
    choices: ["تكثف", "تبخر", "تجمد", "تسامي"],
    answer: "تكثف"
  },
 

  // =========================
  // حرف الثاء (4 أسئلة فقط لأن الكلمات قليلة)
  // =========================

 
  {
    q: "ما اسم الحيوان الذي يعيش في الصحراء ويشتهر بالدهاء؟",
    letter: "ث",
    choices: ["ثعلب", "ثعبان", "ثور", "ثروان"],
    answer: "ثعلب"
  },
  {
    q: "  نوع من النباتات يستخدم كدواء؟",
    letter: "ث",
    choices: ["ثوم", "ثفاء", "ثيل", "ثمر"],
    answer: "ثوم"
  },
  {
    q: "ما اسم قطعة الإضاءة المعلقة في السقف؟",
    letter: "ث",
    choices: ["ثريا", "ثوب", "ثعبان", "ثعلب"],
    answer: "ثريا"
  },

  // =========================
  // حرف الجيم (7 أسئلة)
  // =========================

  {
    q: "ما اسم أكبر قارة في العالم؟",
    letter: "ج",
    choices: ["آسيا", "أوروبا", "أفريقيا", "أمريكا"],
    answer: "آسيا"
  },
  {
    q: "ما اسم الحيوان الذي يعيش في الماء وله أصداف؟",
    letter: "ج",
    choices: ["جمبري", "جمل", "جرذ", "جعفر"],
    answer: "جمبري"
  },
  {
    q: "ما اسم الجهاز الذي يضخ الدم في الجسم؟",
    letter: "ج",
    choices: ["الجهاز القلبي","جهاز البولي", "جرس", "جهاز تنفس"],
    answer: "الجهاز القلبي"
  },
 
  
  {
    q: "ما اسم الدولة التي عاصمتها الجزائر؟",
    letter: "ج",
    choices: ["الجزائر", "جورجيا", "جامايكا", "جنوب أفريقيا"],
    answer: "الجزائر"
  },
  {
    q: "ما اسم الحيوان الذي يُعرف بسفينة الصحراء؟",
    letter: "ج",
    choices: ["جمل", "جربوع", "جرذ", "جحش"],
    answer: "جمل"
  },
  {
    q: "ما اسم المادة التي تغطي جسم الإنسان؟",
    letter: "ج",
    choices: ["جلد", "جص", "جبس", "جير"],
    answer: "جلد"
  },


  // =========================
  // حرف الحاء (7 أسئلة)
  // =========================

  {
    q: "ما اسم العضو المسؤول عن تنقية الدم في الجسم؟",
    letter: "ح",
    choices: ["حالب", "حجاب", "حوض", "حلق"],
    answer: "حالب"
  },

  
  {
    q: "ما اسم الحيوان الذي يعيش في الجبال ويشتهر بقرونه؟",
    letter: "ح",
    choices: ["حمار وحشي", "حمل", "حوت", "حصان"],
    answer: "حمل"
  },
 

  

  
  {
    q: "ما اسم الحيوان الذي يسبح ويعيش في البحر؟",
    letter: "ح",
    choices: ["حوت", "حصان", "حمار", "حجل"],
    answer: "حوت"
  },

  // =========================
  // حرف الخاء (7 أسئلة)
  // =========================

 
  
  {
    q: "ما عاصمة السودان؟",
    letter: "خ",
    choices: ["الخرطوم", "خراسان", "خميس مشيط", "خنيفرة"],
    answer: "الخرطوم"
  },
 
  
  {
    q: "ما اسم الحيوان الذي يُعرف بذكائه ويعيش في البحر؟",
    letter: "خ",
    choices: ["خنزير البحر", "خروف", "خرتيت", "خنفساء"],
    answer: "خنزير البحر"
  },

  
 
  
  {
    q: "ما اسم المادة التي تُستخدم في صناعة الأواني الفخارية؟",
    letter: "خ",
    choices: ["خزف", "خشب", "خيش", "خيط"],
    answer: "خزف"
  },

  // =========================
  // حرف الدال (7 أسئلة)
  // =========================

  {
    q: "ما اسم الحيوان الذي يعيش في الماء ويشتهر بالسرعة و مساعدة البشر؟",
    letter: "د",
    choices: ["دباغ", "دجاج", "دلفين", "دب"],
    answer: "دلفين"
  },
  {
    q: "ما عاصمة سوريا؟",
    letter: "د",
    choices: ["دمشق", "دومينيكا", "دنمارك", "دبي"],
    answer: "دمشق"
  },

  
 
  
 
  
  {
    q: "ما اسم الحيوان الذي يسبح ويقفز فوق الماء؟",
    letter: "د",
    choices: ["دلفين", "دب", "دجاج", "دود"],
    answer: "دلفين"
  },
 
  

  // =========================
  // حرف الذال (4 أسئلة)
  // =========================

 
  
  {
    q: "ما اسم المعدن الأصفر الثمين؟",
    letter: "ذ",
    choices: ["ذهب", "ذرة", "ذيل", "ذخيرة"],
    answer: "ذهب"
  },
  
  
  {
    q: "ما اسم الجزء الخلفي من الحيوان؟",
    letter: "ذ",
    choices: ["ذيل", "ذرة", "ذهب", "ذراع"],
    answer: "ذيل"
  },

  // =========================
  // حرف الراء (7 أسئلة)
  // =========================


  
  {
    q: "ما عاصمة السعودية؟",
    letter: "ر",
    choices: ["الرياض", "روسيا", "رومانيا", "رواندا"],
    answer: "الرياض"
    
  },
  
  

  

  
  {
    q: "ما عاصمة إيطاليا؟",
    letter: "ر",
    choices: ["روما", "روسيا", "رومانيا", "رواندا"],
    answer: "روما"
  },
  {
    q: "ما اسم المادة التي تُستخدم في البناء؟",
    letter: "ر",
    choices: ["رمل", "رغوة", "رز", "رطب"],
    answer: "رمل"
  },
  // =========================
  // حرف الزاي (7 أسئلة)
  // =========================



  
  {
    q: "ما عاصمة كرواتيا؟",
    letter: "ز",
    choices: ["زغرب", "زامبيا", "زيمبابوي", "زنجبار"],
    answer: "زغرب"
  },

  
  {
    q: "ما اسم النبات الذي يُستخدم كتوابل؟",
    letter: "ز",
    choices: ["زنجبيل", "زعتر", "زيتون", "زنبق"],
    answer: "زنجبيل"
  },
  {
    q: "ما اسم الشيء الذي نستخدمه لحفظ الطعام؟",
    letter: "ز",
    choices: ["زجاج", "زير", "زبدة", "زيت"],
    answer: "زجاج"
  },
  {
    q: "ما اسم المادة التي تُستخرج من الزيتون؟",
    letter: "ز",
    choices: ["زيت", "زبدة", "زلال", "زيت سمسم"],
    answer: "زيت"
  },

  // =========================
  // حرف السين (7 أسئلة)
  // =========================

 
  
  {
    q: "ما اسم الدولة التي عاصمتها ستوكهولم؟",
    letter: "س",
    choices: ["السويد", "سويسرا", "سوريا", "سورينام"],
    answer: "السويد"
  },
  {
    q: "ما اسم العملية التي يتم فيها تحويل السكر إلى طاقة؟",
    letter: "س",
    choices: ["استقلاب", "سريان", "سحب", "سقوط"],
    answer: "استقلاب"
  },
 
  
  {
    q: "ما اسم المادة التي تُستخدم في الكتابة؟",
    letter: "س",
    choices: ["سائل الحبر", "سكر", "سجاد", "سلك"],
    answer: "سائل الحبر"
  },
 
  

  

  // =========================
  // حرف الشين (7 أسئلة)
  // =========================


  

  

  

  

  

  

  // =========================
  // حرف الصاد (7 أسئلة)
  // =========================

 
  

  
  {
    q: "ما عاصمة اليمن؟",
    letter: "ص",
    choices: ["صنعاء", "صربيا", "صومال", "صقلية"],
    answer: "صنعاء"
  },
  

    
 
  
 
  

  // =========================
  // حرف الضاد (4 أسئلة)
  // =========================

  {
    q: "عرفت اللغة العربية بأنها لغة....؟",
    letter: "ض",
    choices:["الضاد", "ضوء", "ضباب", "ضجيج"],
    answer: "الضاد"
  },
 
  
  {
    q: "ما اسم الحالة الجوية التي تقل فيها الرؤية؟",
    letter: "ض",
    choices: ["ضباب", "ضوء", "ضجيج", "ضوضاء"],
    answer: "ضباب"
  },
  {
    q: "ما اسم الصوت المرتفع غير المرغوب فيه؟",
    letter: "ض",
    choices: ["ضجيج", "ضوء", "ضباب", "ضوضاء"],
    answer: "ضجيج"
  },
  // =========================
  // حرف الطاء (7 أسئلة)
  // =========================

  {
    q: "ما اسم العملية التي يتم فيها رفع الشيء إلى أعلى؟",
    letter: "ط",
    choices: ["طيران", "طحن", "طبخ", "طرد"],
    answer: "طيران"
  },
  {
    q: "ما عاصمة ليبيا؟",
    letter: "ط",
    choices: ["طرابلس", "طاجيكستان", "طوكيو", "طبرق"],
    answer: "طرابلس"
  },
  
  
  

    
 
  

  

  

  // =========================
  // حرف الظاء (4 أسئلة)
  // =========================


  
  {
    q: "ما اسم الظاهرة التي يحدث فيها انعدام الضوء؟",
    letter: "ظ",
    choices: ["ظلام", "ظرف", "ظفر", "ظل"],
    answer: "ظلام"
  },
  {
    q: "ما اسم الجزء الحاد في الإصبع؟",
    letter: "ظ",
    choices: ["ظفر", "ظرف", "ظلام", "ظل"],
    answer: "ظفر"
  },
  {
    q: "ما اسم الوعاء الورقي المستخدم للبريد؟",
    letter: "ظ",
    choices: ["ظرف", "ظفر", "ظلام", "ظل"],
    answer: "ظرف"
  },

  // =========================
  // حرف العين (7 أسئلة)
  // =========================

  {
    q: "ما اسم العضو المسؤول عن الرؤية؟",
    letter: "ع",
    choices: ["عين", "عظم", "عصب", "عقد"],
    answer: "عين"
  },
  {
    q: "ما عاصمة الأردن؟",
    letter: "ع",
    choices: ["عَمان", "عمان", "غانا", "عسير"],
    answer: "عَمان"
  },

  

  
 
  

  

  

  // =========================
  // حرف الغين (7 أسئلة)
  // =========================

  {
    q: "مادة لاصق تسمى؟",
    letter: "غ",
    choices: ["غراء", "غبار", "غلاف", "غصن"],
    answer: "غراء"
  },
  {
    q: "ما اسم الحيوان الذي يعيش في الغابة ويشتهر بقوته؟",
    letter: "غ",
    choices: ["غوريلا", "غزال", "غراب", "غرير"],
    answer: "غوريلا"
  },
  {
    q: "ما اسم الدولة التي عاصمتها غانا؟",
    letter: "غ",
    choices: ["غانا", "غينيا", "غواتيمالا", "غرينادا"],
    answer: "غانا"
  },
  {
    q: "ما اسم العملية التي يتم فيها إزالة الشوائب؟",
    letter: "غ",
    choices: ["غسل", "غلي", "غمر", "غوص"],
    answer: "غسل"
  },

  

  
  {
    q: "ما اسم الحيوان الذي يطير وله صوت نعيق؟",
    letter: "غ",
    choices: ["غراب", "غزال", "غرير", "غوريلا"],
    answer: "غراب"
  },

  // =========================
  // حرف الفاء (7 أسئلة)
  // =========================

  {
    q: "ما اسم المادة التي تُستخدم في تنظيف الأسنان؟",
    letter: "ف",
    choices: ["فرشاة", "فحم", "فول", "فخار"],
    answer: "فرشاة"
  },
  {
    q: "ما عاصمة المغرب؟",
    letter: "ف",
    choices: ["فاس", "فرنسا", "فنزويلا", "فلسطين"],
    answer: "فاس"
  },

  

  
  {
    q: "ما اسم المادة التي تُستخدم في إشعال النار؟",
    letter: "ف",
    choices: ["فحم", "فخار", "فول", "فستق"],
    answer: "فحم"
  },
  {
    q: "ما اسم الجهاز الذي يُستخدم في التبريد؟",
    letter: "ف",
    choices: ["فريزر", "فحم", "فول", "فخار"],
    answer: "فريزر"
  },

  
  // =========================
  // حرف القاف (7 أسئلة)
  // =========================

  {
    q: "للكتابة نستخدم...؟",
    letter: "ق",
    choices: ["قلم", "قرطاس", "قماش", "قشرة"],
    answer: "قلم"
  },
  {
    q: "ما عاصمة مصر؟",
    letter: "ق",
    choices: ["القاهرة", "قطر", "قبرص", "قيرغيزستان"],
    answer: "القاهرة"
  },

  

  
 
  

  
  {
    q: "ما اسم العملية التي يتم فيها قطع الشيء؟",
    letter: "ق",
    choices: ["قص", "قشط", "قفل", "قذف"],
    answer: "قص"
  },

  // =========================
  // حرف الكاف (7 أسئلة)
  // =========================

 
  
  {
    q: "ما اسم الدولة التي عاصمتها الكويت؟",
    letter: "ك",
    choices: ["الكويت", "كندا", "كازاخستان", "كوريا"],
    answer: "الكويت"
  },

  
 
  
  {
    q: "ما اسم الحيوان الذي يعيش في أستراليا؟",
    letter: "ك",
    choices: ["كنغر", "كوبرا", "كلب", "كركدن"],
    answer: "كنغر"
  },
 
  

  

  // =========================
  // حرف اللام (7 أسئلة)
  // =========================

 
  
  {
    q: "ما عاصمة بريطانيا؟",
    letter: "ل",
    choices: ["لندن", "لبنان", "ليبيا", "لوكسمبورغ"],
    answer: "لندن"
  },
 
  
 
  
  {
    q: "ما اسم الحيوان الذي يطير وله منقار طويل؟",
    letter: "ل",
    choices: ["لقلق", "لاما", "لوري", "لبوة"],
    answer: "لقلق"
  },
  

    
 
  

  // =========================
  // حرف الميم (7 أسئلة)
  // =========================

  

    
  {
    q: "ما عاصمة أسبانيا؟",
    letter: "م",
    choices: ["مدريد", "مالطا", "مصر", "موريتانيا"],
    answer: "مدريد"
  },
 
  

  

  
  {
    q: "ما اسم الجهاز الذي يُستخدم في التبريد؟",
    letter: "م",
    choices: ["مكيف", "مغناطيس", "مقص", "مكبس"],
    answer: "مكيف"
  },

  
  // =========================
  // حرف النون (7 أسئلة)
  // =========================


  
  {
    q: "ما عاصمة كينيا؟",
    letter: "ن",
    choices: ["نيروبي", "نيبال", "نيجيريا", "نيوزيلندا"],
    answer: "نيروبي"
  },

  

  // =========================
  // حرف الهاء (7 أسئلة)
  // =========================


  
  {
    q: "ما عاصمة فيتنام؟",
    letter: "هـ",
    choices: ["هانوي", "هولندا", "هونغ كونغ", "هايتي"],
    answer: "هانوي"
  },
  

  // =========================
  // حرف الواو (7 أسئلة)
  // =========================

  {
    q: "ما اسم المادة التي تُستخدم في إشعال النار؟",
    letter: "و",
    choices: ["وقود", "ورد", "وتر", "وسم"],
    answer: "وقود"
  },
  {
    q: "ما عاصمة بولندا؟",
    letter: "و",
    choices: ["وارسو", "ويلز", "واشنطن", "ويندهوك"],
    answer: "وارسو"
  },
 


  // =========================
  // حرف الياء (7 أسئلة)
  // =========================


  
  {
    q: "ما عاصمة أرمينيا؟",
    letter: "ي",
    choices: ["يريفان", "يونان", "يابان", "يمن"],
    answer: "يريفان"
  },

  {
        letter: "أ",
        q: "ما هو الحيوان الذي يُلقّب بملك الغابة؟",
        choices: ["الفهد", "الأسد", "النمر", "الذئب"],
        answer: "الأسد"
    },
    {
        letter: "أ",
        q:"- نبي سميت سورة من القران بأسمه ؟ " ,
        choices: ["داود", "نوح", "عيسى","إبراهيم"],
        answer: "إبراهيم"
    },
    {
         letter:"أ",
         q:"من هو النبي الذي ألقاه قومه في النار",
         choices:["محمد","موسى","سليمان","إبراهيم"],
         answer:"إبراهيم"

    },
     {
         letter:"أ",
         q:"صاحبة المقولة الشهيرة لا يضر الشاه سلخها بعد ذبحها ؟",
         choices:["أسماء بنت أبي بكر","خديجة بنت خويلد","الخنساء","مريم بنت عمران"],
         answer:"أسماء بنت أبي بكر"

    },

     {
         letter:"ب",
         q:"الاصبع الذي يلي الاصغر لليد",
         choices:["خنصر","بنصر","السباحة","الإبهام"],
         answer:"بنصر"

    },
     {
         letter:"ب",
         q:" اكمل الحديث اتق الله ولو",
         choices:["بصدقة","بكيلو من شعير","بشق تمرة","بمسك"],
         answer:"بشق تمرة"

    },
     {
         letter:"ب",
         q:"من هو امين النبي صلى الله عليه وسلم على نفقاته",
         choices:["بلال بن رباح","عمر بن الخطاب","خالد بن الوليد","عمرو بن العاص"],
         answer:"بلال بن رباح"

    },
     {
         letter:"ت",
         q:"صلاة يختص بها شهر رمضان المعظم",
         choices:["تراويح","تهجد","تدبر","تأويل"],
         answer:"تراويح"

    },
     {
         letter:"ت",
         q:"معجم لغوى وضعه المرتضي الزبيدى",
         choices:["لسان العرب","تاج العروس","القاموس المحيط","العين"],
         answer:"تاج العروس"

    },
     {
         letter:"ت",
         q:"لقب عبدالله بن العباس رضى الله عنه ؟",
         choices:["ترجمان القرآن","تأويل القآن","تالي القرآن","تلمسان القرآن"],
         answer:"ترجمان القرآن"

    },
     {
         letter:"ث",
         q:"قبيلة صالح عليه السلام ؟",
         choices:["ثامن","ثروين","ثكوان","ثمود"],
         answer:"ثمود"

    },
     {
         letter:"ث",
         q:"أجر",
         choices:["ثواب","ثبات","ثقاب","ثمان"],
         answer:"ثواب"

    },
     {
         letter:"ث",
         q:"البقية من الشراب في أسفل الاناء ؟",
         choices:["ثعالة","ثمالة","ثغالة","ثجانة"],
         answer:"ثمالة"

    },
     {
         letter:"ج",
         q:"الليل والنهار لهم اسم ؟",
         choices:["جديدان","جديران","جميان","جريران"],
         answer:"جديدان"

    },
     {
         letter:"ج",
         q:"كلمة تطلق على الرجل الكريم ؟",
         choices:["جحجاح","جحدار","جرجاح","جحبار"],
         answer:"جحجاح"

    },
     {
         letter:"ج",
         q:"لزم مكانه فلم يبرحه ؟",
         choices:["جثر","جثم","جنم","جرم"],
         answer:"جثم"

    },
     {
         letter:"ح",
         q:"لقب لعلى بن ابي طالب رضى الله عنه لقبته به أمه ؟",
         choices:["حجبرة","حمدرة","حنجرة","حيدرة"],
         answer:"حيدرة"

    },
     {
         letter:"ح",
         q:"شاعر النبي صلى الله عليه وسلم ؟",
         choices:["حسان بن ثابت","حسان بن ثوبان","حسان بن مرة","حسان بن وهب"],
         answer:"حسان بن ثابت"

    },
     {
         letter:"ح",
         q:"من هو صاحب سر النبي صلى الله عليه وسلم ؟ ",
         choices:["حذيفة بن اليمان","حذيقة بن المقرب","حذيفة بن واصل ","حذيفة بن عمرو"],
         answer:"حذيفة بن اليمان"

    },
     {
         letter:"خ",
         q:"انعقاد اللسان عن الكلام ؟",
         choices:["خرس","خور","خدر","خشر"],
         answer:"خرس"

    },
     {
         letter:"خ",
         q:"من أول أمرأة تزوجها النبي صلى الله عليه وسلم ؟",
         choices:["خديجة بنت خويلد","خديجة بنت الأجشش","خديجة بنت مطرف","خديجة بنت عمران"],
         answer:"خديجة بنت خويلد"

    },
     {
         letter:"خ",
         q:"من هو فاتح الحيرة ؟",
         choices:["خالد بن طارق","خلاد المزني","خويلد بن حاطب","خالد بن الوليد"],
         answer:"خالد بن الوليد"

    },
     {
         letter:"د",
         q:"من هو النبي الذي سخر الله له الجبال تسبح معه ؟",
         choices:["دانيال","داود","دارى","دايم"],
         answer:"داود"

    },
     {
         letter:"د",
         q:"بماذا يسمي يوم الاربعاء في الجاهلية ؟ ",
         choices:["دبار","ديار","دمار","دثار"],
         answer:"دبار"

    },
     {
         letter:"د",
         q:" أبطل الحجة ؟",
         choices:["دحض","دعم","دعج","دحص"],
         answer:"دحض"

    },
     {
         letter:"ذ",
         q:"سيف شهير لعمر بن الخطاب ؟",
         choices:["ذو الموشح","ذو الشيايح","ذو الوشاح","ذو الشايح"],
         answer:"ذو الوشاح"

    },
     {
         letter:"ذ",
         q:"أعلى كل شىء ؟",
         choices:["ذروة","ذفرة","ذجوة","ذجرة"],
         answer:"ذروة"

    },
     {
         letter:"ذ",
         q:"انتشر الخبر ؟",
         choices:["ذاع","ذان","ذام","ذار"],
         answer:"ذاع"

    },
     {
         letter:"ر",
         q:"سيبوية كلمة فارسية ماذا تعني ؟",
         choices:["رائحة التفاح","رائحة الياسمين","رائحة الفراولة","رائحة الموز"],
         answer:"رائحة التفاح"

    },
     {
         letter:"ر",
         q:"اداة قديمة لطحن الحبوب ؟ ",
         choices:["رجى","رخى","رحى","رفى"],
         answer:"رحى"

    },
     {
         letter:"ر",
         q:"من هو مخترع الغواصة ؟",
         choices:["روبرت فواتن","روبن هود","روميو","راين هيت"],
         answer:"روبرت فواتن"

    },
     {
         letter:"ز",
         q:"ماء مبارك ؟",
         choices:["زمزم","زمزن","زممم","زمرم"],
         answer:"زمزم"

    },
      {
         letter:"ز",
         q:"احد أصحاب المعلقات العشر ؟",
         choices:["زهير بن مقري","زهير بن أبي سلمى","زهير بن وائل","زهير بن حجر"],
         answer:"زهير بن أبي سلمى"

    },
      {
         letter:"ز",
         q:"المعدن الوحيد الذي يوجد في حالة سائلة ؟",
         choices:["زئبق","زعبق","زنك","زفت"],
         answer:"زئبق"

    },
      {
         letter:"س",
         q:"من كبار علماء اللغة العربية ؟ ",
         choices:["سيبويح","سناء الملك","سيبويه","سيرويه"],
         answer:"سيبويه"

    },
      {
         letter:"س",
         q:"ماذا يطلق على الجماعة من النساء ؟",
         choices:["سرب","سره","سبر","سرج"],
         answer:"سرب"

    },
      {
         letter:"س",
         q:"من هم أهل الوبر ؟",
         choices:["سكان الأبنبة","سكان الخيام","سكان القبور","سكان الكهوف"],
         answer:"سكان الخيام"

    },
      {
         letter:"ش",
         q:"مشروب صيني المنشأ ؟",
         choices:["شاي","شوفان","شوربة","شنق"],
         answer:"شاي"

    },
      {
         letter:"ش",
         q:"من الطيور حسن الصوت ؟",
         choices:["شحرور","شخصوص","شمنون","شمعون"],
         answer:"شحرور"

    },
      {
         letter:"ش",
         q:"ولد الظبية ؟",
         choices:["شادن","شاون","شاوم","شادم"],
         answer:"شادن"

    },
      {
         letter:"ص",
         q:"مقدمة كل شىء ؟",
         choices:["صمد","صدر","صادر","صابر"],
         answer:"صدر"

    },
      {
         letter:"ص",
         q:"ماذا يطلق على الجماعة من الابل ؟",
         choices:["صرمة","صرنة","صروة","صومة"],
         answer:"صرمة"

    },
      {
         letter:"ص",
         q:"شجر خشبه طيب الرائحة ؟",
         choices:["صندل","صمغ","صرصر","صومل"],
         answer:"صندل"

    },
      {
         letter:"ض",
         q:"الانحراف عن دين الله ؟",
         choices:["ضباع","ضرغام","ضلال","ضياع"],
         answer:"ضلال"

    },
      {
         letter:"ض",
         q:"أخو خولة بنت الازور ؟",
         choices:["ضرار","ضرغام","ضاري","ضاعن"],
         answer:"ضرار"

    },
      {
         letter:"ض",
         q:"قليل لا عمق فيه ؟",
         choices:["ضحل","ضاحل","ضحين","ضاحن"],
         answer:"ضحل"

    },
      {
         letter:"ط",
         q:"من هو القائل – لكل مقام مقال – ؟",
         choices:["طرفة بن عبادة","طرفة بن عبيد","طرفة بن عباد","طرفة بن العبد"],
         answer:"طرفة بن العبد"

    },
      {
         letter:"ط",
         q:"مرض يسمى الموت الاسود ؟",
         choices:["طاحون","طاعون","طاجون","طاكون"],
         answer:"طاعون"

    },
      {
         letter:"ط",
         q:"من المبشرين بالجنة ؟",
         choices:["طلحة بن عبيدالله","طلحة بن عبدالله","طلحة بن الزبير","طلحة بن العوام"],
         answer:"طلحة بن عبيد الله"

    },
      {
         letter:"ظ",
         q:"اسم يبين مكان حدوث الفعل يعرف بماذا",
         choices:["ظرف مكان","ظرف زمان","ظرف هيئة","ظرف علة"],
         answer:"ظرف مكان"

    },
      {
         letter:"ظ",
         q:"يطلق على الضيق من كل شىء ؟",
         choices:["ظمك","ظنف","ظنك","ظمن"],
         answer:"ظنك"

    },
      {
         letter:"ظ",
         q:" الذكي البارع الكيس الحسن الهيئة كل هذه تنطبق على كلمة واحدة ؟",
         choices:["ظريف","ظارف","ظروف","ظرفيف"],
         answer:"ظريف"

    },
      {
         letter:"ع",
         q:"أسم يوم الجمعة قديم ؟",
         choices:["عاربة","عروبة","عريبة","عربية"],
         answer:"عروبة"

    },
      {
         letter:"ع",
         q:"من هو قائد المسلمين في معركة بلاط الشهداء ؟",
         choices:["عبدالرحمن الغافقي","عبدالرحمن بن عوف","عبدالرحمن الداخل","عبدالرحمن الخزرجي"],
         answer:"عبدالرحمن الغافقي"

    },
      {
         letter:"ع",
         q:"من أسماء الذهب ؟",
         choices:["عسود","عسحد","عسجد","عمسد"],
         answer:"عسجد"

    },
      {
         letter:"غ",
         q:" أسم يطلق على ذكر السلحفاة ؟",
         choices:["غيلم","غليم","غالم","غلوم"],
         answer:"غيلم"

    },
      {
         letter:"غ",
         q:"ي الحديت : من ـــــــــــــ فليس منا",
         choices:["غشانا","غاششنا","غشونا","غشنا"],
         answer:"غشنا"

    },
      {
         letter:"غ",
         q:"اين كان ينقطع الرسول الكريم عليه الصلاة والسلام للتعبد والصلاة ",
         choices:["غار ثور","غار النور","غار حرا","غار مؤته"],
         answer:"غار حرا"

    },
      {
         letter:"t",
         q:"مقياس قديم من مقايس الطول ؟",
         choices:["فرسخ","فهرنهايت","فرمس","فرتق"],
         answer:"فرسخ"

    },
      {
         letter:"ف",
         q:"أصل كلمة ديوان ؟",
         choices:["فرنسي","فارسي","فيومي","فاطمي"],
         answer:"فارسي"

    },
      {
         letter:"ف",
         q:"من هى أصغر بنات النبي عليه الصلاة والسلام؟",
         choices:["فاطمة","زينب","رقية","أم كلثوم"],
         answer:"فاطمة"

    },
      {
         letter:"ق",
         q:"ماذا يسمى بيت النمل ؟",
         choices:["قبة","قرية","قبوة","قمة"],
         answer:"قرية"

    },
      {
         letter:"ق",
         q:"ماذا يطلق على الجماعة من الرجال ؟",
         choices:["قوم","قين","قمن","قسط"],
         answer:"قوم"

    },
      {
         letter:"ق",
         q:"الصحيفة التى يكتب فيها ؟",
         choices:["قوس","قتم","قنطار","قرطاس"],
         answer:"قرطاس"

    },
      {
         letter:"ك",
         qu:"ماذا يقال لمن جاوز سن الثلاثين الى الخمسين ؟ ",
         choices:["كهل","كله","كاله","كامل"],
         answer:"كهل"

    },
      {
         letter:"ك",
         q:"جعبة صغيرة توضع فيها النبال ( الاسهم ) ؟",
         choices:["كمانة","كنانة","كمان","كلالة"],
         answer:"كنانة"

    },
      {
         letter:"ك",
         q:"يستخرج العنبر من ؟",
         choices:["كبد الحوت","كبد الجمل","كبد السمك","كبد الماعز"],
         answer:"كبد الحوت"

    },
      {
         letter:"ل",
         q:"احد أصحاب المعلقات العشر ؟",
         choices:["لبيد بن معمر","لبيد بن ربيعة","لبيد بن عامر","لبيد بن رابعة"],
         answer:"لبيد بن ربيعة"

    },
      {
         letter:"ل",
         q:"من أسماء الاسد",
         choices:["ليث","لبؤة","ليل","لطم"],
         answer:"ليث"

    },
      {
         letter:"ل",
         q:"من أسماء الفضة",
         choices:["لجين","لحين","لدين","لمين"],
         answer:"لجين"

    },
      {
         letter:"م",
         q:"من هو مؤسس الدولة الأموية",
         choices:[" معاوية بن أبي حرب","معاوية بن أبي سفيان","معاوية بن أبي سيف","معاوية بن أبي جالوت"],
         answer:"معاوية بن أبي سفيان"

    },
      {
         letter:"م",
         q:"من هم الزبانية؟",
         choices:["ملائكة العذاب","ملائكة الرحمة","ملائكة الموت","ملائكة القطر"],
         answer:"ملائكة العذاب"

    },
      {
         letter:"م",
         q:"الساعة الشمسية التي استخدمها العرب قديما تسمى",
         choices:["مرودة","مرولة","معولة","مزولة"],
         answer:"مزولة"

    },
      {
         letter:"ن",
         q:"ما معنى جعفر؟",
         choices:["النهر الكبير","النهر الصغير","البحر الكبير","البحر الصغير"],
         answer:"النهر الصغير"

    },
      {
         letter:"ن",
         q:"بمعنى برك الجمل وقعد",
         choices:["ناخ","تاخ","باخ","ماخ"],
         answer:"ناخ"

    },
      {
         letter:"ن",
         q:"ماهي عاصمة كينيا؟",
         choices:["نيروبي","نيو دلهي","نينوه","نون"],
         answer:"نيروبي"

    },
      {
         letter:"هـ",
         q:"فكرة أو شعور يثير القلق",
         choices:["هاتف","هاجس","هاجر","هامس"],
         answer:"هاجس"

    },
      {
         letter:"هـ",
         q:"ما هو اسم الخليفة الذي كان يَحج عاماً ويغزو عاماً؟",
         choices:["هارون الرشيد","هارون الإخشيدي","هارون الأصفهاني","هارون الممجد"],
         answer:"هارون الرشيد"

    },
      {
         letter:"هـ",
         q:"ما هو الاسم الذي يطلق على الـ 100 من الإبل؟",
         choices:["همنة","هكتة","هفتة","هبتة"],
         answer:"هفتة"

    },
      {
         letter:"و",
         q:"ما معنى النمارق ؟",
         choices:["الوسائد","الوسائل","الوفائر","الوجاير"],
         answer:"الوسائد"

    },
      {
         letter:"و",
         q:"اسم وادي في جهنم",
         choices:["وين","وهن","ويل","وجم"],
         answer:"ويل"

    },
      {
         letter:"و",
         q:"شرب الكلب في الإناء ؟",
         choices:["ولغ","ولع","ولب","ولج"],
         answer:"ولغ"

    },
      {
         letter:"ي",
         q:"حيوان صحراوي يشبه الفأر؟",
         choices:["يربوع","يعسوب","يمحوط","يمسوع"],
         answer:"يربوع"

    },
      {
         letter:"ي",
         q:"ماذا يُسمى القلم قديماً؟",
         choices:["يفاع","يباب","يراع","ينان"],
         answer:"يراع"

    },
      {
         letter:"ي",
         q:"طائر يُلقب بـ القطا ويذكر في الشعر",
         choices:["يمام","يتام","يباب","ينام"],
         answer:"يمام"
         

    }


]; // نهاية المصفوفة
// =========================
// دالة خلط العناصر داخل المصفوفة
// =========================
function shuffle(array) {
  let currentIndex = array.length, randomIndex;

  // طالما لا تزال هناك عناصر لم تُخلط
  while (currentIndex !== 0) {

    // اختيار عنصر عشوائي
    randomIndex = Math.floor(Math.random() * currentIndex);
    currentIndex--;

    // تبديل العناصر
    [array[currentIndex], array[randomIndex]] = [
      array[randomIndex], array[currentIndex]
    ];
  }

  return array;
}

// =========================
// دالة إرجاع سؤال عشوائي من البنك
// =========================
function getRandomQuestion() {
  const randomIndex = Math.floor(Math.random() * questionsBank.length);
  const question = questionsBank[randomIndex];

  // خلط الخيارات قبل الإرجاع
  const shuffledChoices = shuffle([...question.choices]);

  return {
    ...question,
    choices: shuffledChoices
  };
}

// =========================
// دالة إرجاع سؤال حسب الحرف
// =========================
function getQuestionByLetter(letter) {
  const filtered = questionsBank.filter(q => q.letter === letter);

  if (filtered.length === 0) {
    return null; // لا يوجد سؤال لهذا الحرف
  }

  const randomIndex = Math.floor(Math.random() * filtered.length);
  const question = filtered[randomIndex];

  // خلط الخيارات قبل الإرجاع
  const shuffledChoices = shuffle([...question.choices]);

  return {
    ...question,
    choices: shuffledChoices
  };
}